{
  "generate": {
    "title": "Generate Numbers",
    "description": "Generate a sequence of numbers with customizable parameters.",
    "resultTitle": "Generated numbers",
    "arithmeticSequenceOption": "Arithmetic sequence option",
    "startSequenceDescription": "Start sequence from this number.",
    "stepDescription": "Increase each element by this amount",
    "numberOfElementsDescription": "Number of elements in sequence.",
    "separator": "Separator",
    "separatorDescription": "Separate elements in the arithmetic sequence by this character.",
    "toolInfo": {
      "title": "Generate numbers",
      "description": "This tool allows you to generate a sequence of numbers with customizable parameters. You can specify the starting value, step size, and number of elements."
    },
    "title": "Generate",
    "shortDescription": "Generate random numbers in specified ranges"
  },
  "arithmeticSequence": {
    "title": "Arithmetic Sequence",
    "description": "Generate arithmetic sequences with customizable parameters.",
    "resultTitle": "Generated Sequence",
    "sequenceParameters": "Sequence Parameters",
    "firstTermDescription": "First term of the sequence (a₁)",
    "commonDifferenceDescription": "Common difference between terms (d)",
    "numberOfTermsDescription": "Number of terms to generate (n)",
    "outputFormat": "Output Format",
    "separatorDescription": "Separator between terms",
    "toolInfo": {
      "title": "What is an Arithmetic Sequence?",
      "description": "An arithmetic sequence is a sequence of numbers where the difference between each consecutive term is constant. This constant difference is called the common difference. Given the first term (a₁) and the common difference (d), each term can be found by adding the common difference to the previous term."
    },
    "title": "Arithmetic Sequence",
    "shortDescription": "Generate arithmetic sequences"
  },
  "sum": {
    "toolInfo": {
      "title": "What Is a Number Sum Calculator?",
      "description": "This is an online browser-based utility for calculating the sum of a bunch of numbers. You can enter the numbers separated by a comma, space, or any other character, including the line break. You can also simply paste a fragment of textual data that contains numerical values that you want to sum up and the utility will extract them and find their sum."
    },
    "inputTitle": "Input",
    "resultTitle": "Total",
    "numberExtraction": "Number Extraction",
    "runningSum": "Running Sum",
    "printRunningSum": "Print Running Sum",
    "printRunningSumDescription": "Display the sum as it's calculated step by step.",
    "extractionTypes": {
      "smart": {
        "title": "Smart Sum",
        "description": "Auto detect numbers in the input."
      },
      "delimiter": {
        "title": "Number Delimiter",
        "description": "Customize the number separator here. (By default a line break.)"
      }
    },
    "title": "Sum",
    "description": "Calculate the sum of a list of numbers. Enter numbers separated by commas or newlines to get their total sum.",
    "shortDescription": "Calculate sum of numbers"
  },
  "ohmsLaw": {
    "title": "Ohm's Law",
    "description": "Calculates voltage, current and resistance",
    "shortDescription": "Calculate voltage, current, or resistance in electrical circuits using Ohm's Law",
    "longDescription": "This calculator applies Ohm's Law (V = I × R) to determine any of the three electrical parameters when the other two are known. Ohm's Law is a fundamental principle in electrical engineering that describes the relationship between voltage (V), current (I), and resistance (R). This tool is essential for electronics hobbyists, electrical engineers, and students working with circuits to quickly solve for unknown values in their electrical designs."
  },
  "slackline": {
    "title": "Slackline Tension",
    "description": "Calculates tension in a slackline",
    "shortDescription": "Calculate the approximate tension of a slackline or clothesline. Do not rely on this for safety.",
    "longDescription": "This calculator assumes a load in the center of the rope"
  },
  "sphereArea": {
    "title": "Area of a Sphere",
    "description": "Area of a Sphere",
    "shortDescription": "Calculate the surface area of a sphere based on its radius",
    "longDescription": "This calculator determines the surface area of a sphere using the formula A = 4πr². You can either input the radius to find the surface area or enter the surface area to calculate the required radius. This tool is useful for students studying geometry, engineers working with spherical objects, and anyone needing to perform calculations involving spherical surfaces."
  },
  "sphereVolume": {
    "title": "Volume of a Sphere",
    "description": "Volume of a Sphere",
    "shortDescription": "Calculate the volume of a sphere using radius or diameter",
    "longDescription": "This calculator computes the volume of a sphere using the formula V = (4/3)πr³. You can input either the radius or diameter to find the volume, or enter the volume to determine the required radius. The tool is valuable for students, engineers, and professionals working with spherical objects in fields such as physics, engineering, and manufacturing."
  },
  "voltageDropInWire": {
    "title": "Round trip voltage drop in cable",
    "description": "Calculates round trip voltage and power loss in a 2 conductor cable",
    "shortDescription": "Calculate voltage drop and power loss in electrical cables based on length, material, and current",
    "longDescription": "This calculator helps determine the voltage drop and power loss in a two-conductor electrical cable. It takes into account the cable length, wire gauge (cross-sectional area), material resistivity, and current flow. The tool calculates the round-trip voltage drop, total resistance of the cable, and the power dissipated as heat. This is particularly useful for electrical engineers, electricians, and hobbyists when designing electrical systems to ensure voltage levels remain within acceptable limits at the load."
  }
}
