{
  "changeCsvSeparator": {
    "description": "Измените разделитель/разделитель в CSV-файлах. Конвертируйте данные между различными форматами CSV, такими как запятая, точка с запятой, табуляция или пользовательские разделители.",
    "shortDescription": "Изменить разделитель CSV-файла",
    "title": "Изменить разделитель CSV"
  },
  "csvRowsToColumns": {
    "description": "Этот инструмент преобразует строки CSV-файла (значения, разделённые запятыми) в столбцы. Он извлекает горизонтальные строки из входного CSV-файла одну за другой, поворачивает их на 90 градусов и выводит в виде вертикальных столбцов, разделённых запятыми.', longDescription: 'Этот инструмент преобразует строки CSV-файла (значения, разделённые запятыми) в столбцы. Например, если входные данные CSV-файла содержат 6 строк, то и выходные данные будут содержать 6 столбцов, а элементы строк будут расположены сверху вниз. В правильно сформированном CSV-файле количество значений в каждой строке одинаково. Однако, если в строках отсутствуют поля, программа может их исправить, и вы можете выбрать один из доступных вариантов: заполнить отсутствующие данные пустыми элементами или заменить отсутствующие данные пользовательскими элементами, такими как «missing», «?» или «x». В процессе преобразования инструмент также очищает CSV-файл от ненужной информации, такой как пустые строки (строки без видимой информации) и комментарии. Чтобы инструмент правильно распознавал комментарии, в настройках можно указать символ в начале строки, с которой начинается комментарий. Обычно это решётка «#» или двойной слеш «//». CSV-abulous!",
    "longDescription": "Этот инструмент преобразует строки CSV-файла (файл с разделителями-запятыми) в столбцы. Например, если входные данные CSV-файла содержат 6 строк, выходные данные будут содержать 6 столбцов, а элементы строк будут расположены сверху вниз. В правильно сформированном CSV-файле количество значений в каждой строке одинаково. Однако, если в строках отсутствуют поля, программа может их исправить, и вы можете выбрать один из доступных вариантов: заполнить отсутствующие данные пустыми элементами или заменить отсутствующие данные пользовательскими элементами, например,",
    "shortDescription": "Преобразовать строки CSV в столбцы.",
    "title": "Преобразование строк CSV в столбцы"
  },
  "csvToJson": {
    "columnSeparator": "Разделитель столбцов (например, , ; \\t)",
    "commentSymbol": "Символ комментария (например, #)",
    "conversionOptions": "Варианты конвертации",
    "description": "Конвертируйте CSV-файлы в формат JSON с настраиваемыми параметрами разделителей, кавычек и форматирования вывода. Поддержка заголовков, комментариев и динамического преобразования типов.",
    "dynamicTypes": "Динамические типы",
    "dynamicTypesDescription": "Автоматически преобразовывать числа и логические значения",
    "error": "Ошибка",
    "errorParsing": "Ошибка анализа CSV: {{error}}",
    "fieldQuote": "Поле Цитата (например, \")",
    "inputCsvFormat": "Входной формат CSV",
    "inputTitle": "Входной CSV-файл",
    "invalidCsvFormat": "Неверный формат CSV",
    "resultTitle": "Выходной JSON",
    "shortDescription": "Конвертируйте данные CSV в формат JSON.",
    "skipEmptyLines": "Пропускать пустые строки",
    "skipEmptyLinesDescription": "Игнорировать пустые строки во входном CSV-файле",
    "title": "Конвертировать CSV в JSON",
    "toolInfo": {
      "description": "Этот инструмент преобразует файлы CSV (Comma Separated Values, разделённые запятыми) в структуры данных JavaScript Object Notation (JSON). Он поддерживает различные форматы CSV с настраиваемыми разделителями, кавычками и символами комментариев. Конвертер может обрабатывать первую строку как заголовок, пропускать пустые строки и автоматически определять типы данных, такие как числа и логические значения. Полученный JSON можно использовать для миграции данных, резервного копирования или в качестве входных данных для других приложений.",
      "title": "Что такое конвертер CSV в JSON?"
    },
    "useHeaders": "Использовать заголовки",
    "useHeadersDescription": "Относиться к первой строке как к заголовкам столбцов"
  },
  "csvToTsv": {
    "description": "Загрузите CSV-файл в форму ниже, и он будет автоматически преобразован в TSV-файл. В настройках инструмента вы можете настроить формат входного CSV-файла: указать разделитель полей, символ кавычек и символ комментария, а также включить пропуск пустых строк CSV-файла и выбрать, сохранять ли заголовки столбцов CSV-файла.",
    "longDescription": "Этот инструмент преобразует данные из формата CSV (Comma Separated Values) в данные из формата TSV (Tab Separated Values). CSV и TSV — популярные форматы файлов для хранения табличных данных, но в них используются разные разделители для разделения значений: в CSV используются запятые (",
    "shortDescription": "Конвертировать данные CSV в формат TSV.",
    "title": "Конвертировать CSV в TSV"
  },
  "csvToXml": {
    "description": "Конвертируйте CSV-файлы в формат XML с настраиваемыми параметрами.",
    "shortDescription": "Конвертировать данные CSV в формат XML.",
    "title": "Конвертировать CSV в XML"
  },
  "csvToYaml": {
    "description": "Просто загрузите CSV-файл в форму ниже, и он автоматически будет преобразован в YAML-файл. В настройках инструмента вы можете указать символ разделителя полей, символ кавычки и символ комментария, чтобы адаптировать инструмент к пользовательским форматам CSV. Кроме того, вы можете выбрать выходной формат YAML: с сохранением заголовков CSV или без них.",
    "longDescription": "Этот инструмент преобразует данные CSV (значения, разделенные запятыми) в данные YAML (еще один язык разметки). CSV — это простой табличный формат, используемый для представления матричных типов данных, состоящих из строк и столбцов. YAML, с другой стороны, — более продвинутый формат (фактически, надмножество JSON), который создает более удобочитаемые данные для сериализации и поддерживает списки, словари и вложенные объекты. Эта программа поддерживает различные форматы входных CSV: входные данные могут быть разделены запятыми (по умолчанию), точкой с запятой, вертикальной чертой или использовать совершенно другой разделитель. Вы можете указать точный разделитель, который будут использовать ваши данные, в параметрах. Аналогично, в параметрах вы можете указать символ кавычек, который будет использоваться для переноса полей CSV (по умолчанию это символ двойной кавычки). Вы также можете пропускать строки, начинающиеся с комментариев, указав символы комментариев в параметрах. Это позволяет поддерживать чистоту данных, пропуская ненужные строки. Существует два способа преобразования CSV в YAML. Первый метод преобразует каждую строку CSV в список YAML. Второй метод извлекает заголовки из первой строки CSV и создает объекты YAML с ключами на основе этих заголовков. Вы также можете настроить выходной формат YAML, указав количество пробелов для отступов в структурах YAML. Если вам необходимо выполнить обратное преобразование, то есть преобразовать YAML в CSV, вы можете воспользоваться нашим инструментом для преобразования YAML в CSV. Csv-abulous!",
    "shortDescription": "Быстро конвертируйте CSV-файл в YAML-файл.",
    "title": "Конвертировать CSV в YAML"
  },
  "findIncompleteCsvRecords": {
    "checkingOptions": "Проверка параметров",
    "commentCharacterDescription": "Введите символ начала строки комментария. Строки, начинающиеся с этого символа, будут пропущены.",
    "csvInputOptions": "Параметры ввода CSV",
    "csvSeparatorDescription": "Введите символ, используемый для разделения столбцов во входном CSV-файле.",
    "deleteLinesWithNoData": "Удалить строки без данных",
    "deleteLinesWithNoDataDescription": "Удалить пустые строки из входного CSV-файла.",
    "description": "Просто загрузите CSV-файл в форму ниже, и этот инструмент автоматически проверит наличие всех пропущенных значений в строках и столбцах. В настройках инструмента можно настроить формат входного файла (указать разделитель, символ кавычки и символ комментария). Кроме того, можно включить проверку на наличие пустых значений, пропускать пустые строки и установить ограничение на количество сообщений об ошибках в выходных данных.",
    "findEmptyValues": "Найти пустые значения",
    "findEmptyValuesDescription": "Вывести сообщение о пустых полях CSV (это не отсутствующие поля, а поля, которые ничего не содержат).",
    "inputTitle": "Входной CSV-файл",
    "limitNumberOfMessages": "Ограничить количество сообщений",
    "messageLimitDescription": "Установите ограничение на количество сообщений в выводе.",
    "quoteCharacterDescription": "Введите символ кавычек, используемый для заключения в кавычки полей ввода CSV.",
    "resultTitle": "Статус CSV",
    "shortDescription": "Быстро находите строки и столбцы в CSV-файле, в которых отсутствуют значения.",
    "title": "Найти неполные записи CSV",
    "toolInfo": {
      "title": "Что такое {{title}}?"
    }
  },
  "insertCsvColumns": {
    "appendColumns": "Добавить столбцы",
    "commentCharacterDescription": "Введите символ начала строки комментария. Строки, начинающиеся с этого символа, будут пропущены.",
    "csvOptions": "Параметры CSV",
    "csvSeparator": "CSV-разделитель",
    "csvToInsert": "CSV для вставки",
    "csvToInsertDescription": "Введите один или несколько столбцов, которые вы хотите вставить в CSV-файл. Символ, используемый для разделения столбцов, должен совпадать с символом во входном CSV-файле. P.S. Пустые строки будут игнорироваться.",
    "customFillDescription": "Если входной CSV-файл неполный (отсутствуют значения), то можно ли добавить пустые поля или пользовательские символы в записи, чтобы создать правильно сформированный CSV-файл?",
    "customFillValueDescription": "Используйте это пользовательское значение для заполнения отсутствующих полей. (Работает только с режимом «Пользовательские значения», описанным выше.)",
    "customPosition": "Пользовательская позиция",
    "customPositionOptionsDescription": "Выберите способ вставки столбцов в CSV-файл.",
    "description": "Добавить новые столбцы в данные CSV в указанных позициях.",
    "fillWithCustomValues": "Заполнить таможенные значения",
    "fillWithEmptyValues": "Заполнить пустыми значениями",
    "headerName": "Имя заголовка",
    "headerNameDescription": "Заголовок столбца, после которого вы хотите вставить столбцы.",
    "inputTitle": "Входной CSV-файл",
    "insertingPositionDescription": "Укажите, куда вставлять столбцы в CSV-файле.",
    "position": "Позиция",
    "positionOptions": "Варианты позиций",
    "prependColumns": "Добавить столбцы",
    "quoteCharDescription": "Введите символ кавычек, используемый для заключения в кавычки полей ввода CSV.",
    "resultTitle": "Вывод CSV",
    "rowNumberDescription": "Номер столбца, после которого вы хотите вставить столбцы.",
    "separatorDescription": "Введите символ, используемый для разделения столбцов во входном CSV-файле.",
    "shortDescription": "Быстро вставляйте один или несколько новых столбцов в любое место CSV-файла.",
    "title": "Вставить столбцы CSV",
    "toolInfo": {
      "description": "Этот инструмент позволяет добавлять новые столбцы в CSV-данные в заданных позициях. Вы можете добавлять столбцы в начало, конец или вставлять их в произвольные позиции, используя названия заголовков или номера столбцов.",
      "title": "Вставить столбцы CSV"
    }
  },
  "swapCsvColumns": {
    "description": "Просто загрузите CSV-файл в форму ниже, укажите столбцы для замены, и инструмент автоматически изменит положение указанных столбцов в выходном файле. В настройках инструмента вы можете указать положение или названия столбцов, которые хотите заменить, а также исправить неполные данные и при необходимости удалить пустые и закомментированные записи.",
    "longDescription": "Этот инструмент реорганизует данные CSV, меняя местами столбцы. Перестановка столбцов может улучшить читаемость CSV-файла, размещая часто используемые данные вместе или в начале для более удобного сравнения и редактирования. Например, можно поменять местами первый столбец с последним или второй столбец с третьим. Чтобы поменять местами столбцы, выберите",
    "shortDescription": "Изменить порядок столбцов CSV.",
    "title": "Поменять местами столбцы CSV"
  },
  "transposeCsv": {
    "description": "Просто загрузите свой CSV-файл в форму ниже, и этот инструмент автоматически транспонирует его. В настройках инструмента вы можете указать символ, с которого начинаются строки комментариев в CSV-файле, чтобы удалить их. Кроме того, если CSV-файл неполный (содержат пропущенные значения), вы можете заменить пропущенные значения пустым символом или пользовательским символом.",
    "longDescription": "Этот инструмент транспонирует данные, разделенные запятыми (CSV). Он обрабатывает CSV как матрицу данных и переворачивает все элементы по главной диагонали. Выходные данные содержат те же данные CSV, что и входные, но теперь все строки стали столбцами, а все столбцы — строками. После транспонирования CSV-файл будет иметь противоположные размеры. Например, если входной файл содержит 4 столбца и 3 строки, выходной файл будет содержать 3 столбца и 4 строки. Во время преобразования программа также очищает данные от ненужных строк и исправляет неполные данные. В частности, инструмент автоматически удаляет все пустые записи и комментарии, начинающиеся с определенного символа, который можно задать в настройках. Кроме того, в случае повреждения или потери данных CSV-файла утилита дополняет файл пустыми полями или пользовательскими полями, которые можно указать в настройках. CSV-abulous!",
    "shortDescription": "Быстро транспонируйте CSV-файл.",
    "title": "Транспонировать CSV"
  }
}
