{
  "changeCsvSeparator": {
    "description": "CSV फ़ाइलों में सीमांकक/विभाजक बदलें। विभिन्न CSV प्रारूपों जैसे अल्पविराम, अर्धविराम, टैब या कस्टम विभाजकों के बीच रूपांतरण करें।",
    "shortDescription": "CSV फ़ाइल सीमांकक बदलें",
    "title": "CSV विभाजक बदलें"
  },
  "changeSeparator": {
    "comma": "कॉमा",
    "commonSeparators": "सामान्य विभाजक",
    "description": "CSV फ़ाइल में विभाजक वर्ण बदलें।",
    "inputSeparator": "इनपुट विभाजक",
    "inputSeparatorPlaceholder": "विभाजक",
    "inputTitle": "इनपुट CSV",
    "outputSeparator": "आउटपुट विभाजक",
    "outputSeparatorPlaceholder": "विभाजक",
    "pipe": "पाइप",
    "resultTitle": "परिवर्तित CSV",
    "semicolon": "सेमीकोलन",
    "separatorOptions": "विभाजक विकल्प",
    "tab": "टैब",
    "title": "CSV विभाजक बदलें"
  },
  "csvRowsToColumns": {
    "description": "यह टूल CSV (कॉमा सेपरेटेड वैल्यूज़) फ़ाइल की पंक्तियों को कॉलम में परिवर्तित करता है। यह इनपुट CSV से क्षैतिज रेखाओं को एक-एक करके निकालता है, उन्हें 90 डिग्री घुमाता है, और उन्हें कॉमा द्वारा अलग किए गए एक के बाद एक लंबवत कॉलम के रूप में आउटपुट करता है।', longDescription: 'यह टूल CSV (कॉमा सेपरेटेड वैल्यूज़) फ़ाइल की पंक्तियों को कॉलम में परिवर्तित करता है। उदाहरण के लिए, यदि इनपुट CSV डेटा में 6 पंक्तियाँ हैं, तो आउटपुट में भी 6 कॉलम होंगे और पंक्तियों के तत्व ऊपर से नीचे की ओर व्यवस्थित होंगे। एक सुव्यवस्थित CSV में, प्रत्येक पंक्ति में मानों की संख्या समान होती है। हालाँकि, यदि पंक्तियों में फ़ील्ड गायब हैं, तो प्रोग्राम उन्हें ठीक कर सकता है और आप उपलब्ध विकल्पों में से चुन सकते हैं: गायब डेटा को खाली तत्वों से भरें या गायब डेटा को कस्टम तत्वों, जैसे \"missing\", \"?\", या \"x\" से बदलें। रूपांतरण प्रक्रिया के दौरान, यह टूल CSV फ़ाइल से अनावश्यक जानकारी, जैसे खाली पंक्तियाँ (ये दृश्यमान जानकारी रहित पंक्तियाँ हैं) और टिप्पणियाँ, भी साफ़ करता है। टूल को टिप्पणियों की सही पहचान करने में मदद करने के लिए, विकल्पों में, आप टिप्पणी शुरू करने वाली पंक्ति की शुरुआत में प्रतीक निर्दिष्ट कर सकते हैं। यह प्रतीक आमतौर पर एक हैश \"#\" या डबल स्लैश \"//\" होता है। Csv-abulous!.",
    "longDescription": "यह टूल CSV (कॉमा सेपरेटेड वैल्यूज़) फ़ाइल की पंक्तियों को कॉलम में बदलता है। उदाहरण के लिए, यदि इनपुट CSV डेटा में 6 पंक्तियाँ हैं, तो आउटपुट में भी 6 कॉलम होंगे और पंक्तियों के तत्व ऊपर से नीचे की ओर व्यवस्थित होंगे। एक सुव्यवस्थित CSV में, प्रत्येक पंक्ति में मानों की संख्या समान होती है। हालाँकि, जब पंक्तियों में फ़ील्ड गायब हों, तो प्रोग्राम उन्हें ठीक कर सकता है और आप उपलब्ध विकल्पों में से चुन सकते हैं: खाली तत्वों से गायब डेटा भरें या कस्टम तत्वों से गायब डेटा को बदलें, जैसे",
    "shortDescription": "CSV पंक्तियों को स्तंभों में परिवर्तित करें.",
    "title": "CSV पंक्तियों को स्तंभों में परिवर्तित करें"
  },
  "csvToJson": {
    "arrayFormat": "सरणी प्रारूप",
    "columnSeparator": "स्तंभ विभाजक (उदाहरणार्थ, , ; \\t)",
    "commentSymbol": "टिप्पणी प्रतीक (उदाहरणार्थ, #)",
    "conversionOptions": "रूपांतरण विकल्प",
    "description": "CSV डेटा को JSON प्रारूप में बदलें।",
    "dynamicTypes": "गतिशील प्रकार",
    "dynamicTypesDescription": "संख्याओं और बूलियन को स्वचालित रूप से परिवर्तित करें",
    "error": "गलती",
    "errorParsing": "CSV पार्स करने में त्रुटि: {{error}}",
    "fieldQuote": "फ़ील्ड उद्धरण (उदाहरणार्थ, \")",
    "firstRowAsHeaders": "पहली पंक्ति शीर्षक के रूप में",
    "includeHeaders": "शीर्षक शामिल करें",
    "inputCsvFormat": "इनपुट CSV प्रारूप",
    "inputTitle": "इनपुट CSV",
    "invalidCsvFormat": "अमान्य CSV प्रारूप",
    "objectFormat": "ऑब्जेक्ट प्रारूप",
    "outputFormat": "आउटपुट प्रारूप",
    "resultTitle": "JSON परिणाम",
    "separatorPlaceholder": "विभाजक",
    "shortDescription": "CSV डेटा को JSON प्रारूप में परिवर्तित करें.",
    "skipEmptyLines": "खाली लाइनें छोड़ें",
    "skipEmptyLinesDescription": "इनपुट CSV में रिक्त पंक्तियों को अनदेखा करें",
    "title": "CSV से JSON",
    "toolInfo": {
      "description": "यह टूल कॉमा सेपरेटेड वैल्यूज़ (CSV) फ़ाइलों को जावास्क्रिप्ट ऑब्जेक्ट नोटेशन (JSON) डेटा स्ट्रक्चर में बदल देता है। यह अनुकूलन योग्य डिलीमीटर, कोट कैरेक्टर और कमेंट सिंबल के साथ विभिन्न CSV फ़ॉर्मैट को सपोर्ट करता है। यह कन्वर्टर पहली पंक्ति को हेडर के रूप में इस्तेमाल कर सकता है, खाली लाइनों को छोड़ सकता है, और संख्याओं और बूलियन जैसे डेटा प्रकारों का स्वचालित रूप से पता लगा सकता है। परिणामी JSON का उपयोग डेटा माइग्रेशन, बैकअप या अन्य अनुप्रयोगों के लिए इनपुट के रूप में किया जा सकता है।",
      "title": "CSV से JSON कनवर्टर क्या है?"
    },
    "useHeaders": "हेडर का उपयोग करें",
    "useHeadersDescription": "पहली पंक्ति को स्तंभ शीर्षक के रूप में मानें"
  },
  "csvToTsv": {
    "conversionOptions": "रूपांतरण विकल्प",
    "description": "CSV फ़ाइल को TSV प्रारूप में बदलें।",
    "inputSeparator": "इनपुट विभाजक",
    "inputSeparatorPlaceholder": "विभाजक",
    "inputTitle": "इनपुट CSV",
    "longDescription": "यह टूल कॉमा सेपरेटेड वैल्यूज़ (CSV) डेटा को टैब सेपरेटेड वैल्यूज़ (TSV) डेटा में बदल देता है। CSV और TSV दोनों ही सारणीबद्ध डेटा संग्रहीत करने के लिए लोकप्रिय फ़ाइल स्वरूप हैं, लेकिन वे मानों को अलग करने के लिए अलग-अलग डिलीमीटर का उपयोग करते हैं - CSV कॉमा (",
    "preserveHeaders": "शीर्षक संरक्षित करें",
    "resultTitle": "TSV परिणाम",
    "shortDescription": "CSV डेटा को TSV प्रारूप में परिवर्तित करें.",
    "title": "CSV से TSV"
  },
  "csvToXml": {
    "conversionOptions": "रूपांतरण विकल्प",
    "description": "CSV डेटा को XML प्रारूप में बदलें।",
    "firstRowAsHeaders": "पहली पंक्ति शीर्षक के रूप में",
    "inputTitle": "इनपुट CSV",
    "resultTitle": "XML परिणाम",
    "rootElement": "मूल तत्व",
    "rootPlaceholder": "तत्व नाम",
    "rowElement": "पंक्ति तत्व",
    "rowPlaceholder": "तत्व नाम",
    "separatorPlaceholder": "विभाजक",
    "shortDescription": "CSV डेटा को XML प्रारूप में परिवर्तित करें.",
    "title": "CSV से XML"
  },
  "csvToYaml": {
    "conversionOptions": "रूपांतरण विकल्प",
    "description": "CSV डेटा को YAML प्रारूप में बदलें।",
    "firstRowAsHeaders": "पहली पंक्ति शीर्षक के रूप में",
    "includeHeaders": "शीर्षक शामिल करें",
    "indentSize": "इंडेंट आकार",
    "inputTitle": "इनपुट CSV",
    "longDescription": "यह टूल CSV (कॉमा सेपरेटेड वैल्यूज़) डेटा को YAML (येट अनदर मार्कअप लैंग्वेज) डेटा में बदल देता है। CSV एक सरल, सारणीबद्ध फ़ॉर्मैट है जिसका उपयोग पंक्तियों और स्तंभों वाले मैट्रिक्स जैसे डेटा प्रकारों को दर्शाने के लिए किया जाता है। दूसरी ओर, YAML एक अधिक उन्नत फ़ॉर्मैट (वास्तव में JSON का एक सुपरसेट) है, जो क्रमांकन के लिए अधिक मानव-पठनीय डेटा बनाता है, और यह सूचियों, शब्दकोशों और नेस्टेड ऑब्जेक्ट्स का समर्थन करता है। यह प्रोग्राम विभिन्न इनपुट CSV फ़ॉर्मैट का समर्थन करता है - इनपुट डेटा कॉमा सेपरेटेड (डिफ़ॉल्ट), सेमीकोलन सेपरेटेड, पाइप सेपरेटेड हो सकता है, या किसी अन्य पूरी तरह से अलग डिलीमीटर का उपयोग कर सकता है। आप विकल्पों में अपने डेटा द्वारा उपयोग किए जाने वाले सटीक डिलीमीटर को निर्दिष्ट कर सकते हैं। इसी प्रकार, विकल्पों में, आप CSV फ़ील्ड को रैप करने के लिए उपयोग किए जाने वाले उद्धरण चिह्न को निर्दिष्ट कर सकते हैं (डिफ़ॉल्ट रूप से एक डबल-कोट प्रतीक)। आप विकल्पों में टिप्पणी चिह्न निर्दिष्ट करके टिप्पणियों से शुरू होने वाली पंक्तियों को भी छोड़ सकते हैं। इससे आप अनावश्यक पंक्तियों को छोड़कर अपने डेटा को साफ़ रख सकते हैं। CSV को YAML में बदलने के दो तरीके हैं। पहली विधि प्रत्येक CSV पंक्ति को एक YAML सूची में बदल देती है। दूसरी विधि पहली CSV पंक्ति से हेडर निकालती है और इन हेडर पर आधारित कुंजियों वाले YAML ऑब्जेक्ट बनाती है। आप YAML संरचनाओं को इंडेंट करने के लिए रिक्त स्थान की संख्या निर्दिष्ट करके आउटपुट YAML प्रारूप को भी अनुकूलित कर सकते हैं। यदि आपको रिवर्स रूपांतरण, यानी YAML को CSV में बदलने की आवश्यकता है, तो आप हमारे YAML को CSV में बदलने वाले टूल का उपयोग कर सकते हैं। Csv-abulous!",
    "resultTitle": "YAML परिणाम",
    "separatorPlaceholder": "विभाजक",
    "shortDescription": "किसी CSV फ़ाइल को शीघ्रता से YAML फ़ाइल में परिवर्तित करें।",
    "sizePlaceholder": "आकार",
    "title": "CSV से YAML"
  },
  "findIncompleteCsvRecords": {
    "checkingOptions": "विकल्पों की जाँच",
    "commentCharacterDescription": "टिप्पणी पंक्ति की शुरुआत दर्शाने वाला वर्ण दर्ज करें। इस चिह्न से शुरू होने वाली पंक्तियाँ छोड़ दी जाएँगी।",
    "csvInputOptions": "CSV इनपुट विकल्प",
    "csvSeparatorDescription": "CSV इनपुट फ़ाइल में कॉलम को सीमांकित करने के लिए प्रयुक्त वर्ण दर्ज करें.",
    "deleteLinesWithNoData": "बिना डेटा वाली पंक्तियाँ हटाएँ",
    "deleteLinesWithNoDataDescription": "CSV इनपुट फ़ाइल से रिक्त पंक्तियाँ हटाएँ.",
    "description": "बस नीचे फॉर्म में अपनी सीएसवी फ़ाइल अपलोड करें और यह टूल स्वचालित रूप से जांच करेगा कि क्या कोई पंक्ति या स्तंभ मूल्य नहीं खो रहे हैं। टूल विकल्पों में, आप इनपुट फ़ाइल प्रारूप को समायोजित कर सकते हैं (विभाजक, उद्धरण वर्ण, और टिप्पणी वर्ण निर्दिष्ट करें)। इसके अतिरिक्त, आप खाली मूल्यों की जांच सक्षम कर सकते हैं, खाली पंक्तियों को छोड़ सकते हैं, और आउटपुट में त्रुटि संदेशों की संख्या पर सीमा निर्धारित कर सकते हैं।",
    "findEmptyValues": "रिक्त मान खोजें",
    "findEmptyValuesDescription": "रिक्त CSV फ़ील्ड के बारे में संदेश प्रदर्शित करें (ये रिक्त फ़ील्ड नहीं हैं, बल्कि वे फ़ील्ड हैं जिनमें कुछ भी नहीं है)।",
    "inputTitle": "इनपुट CSV",
    "limitNumberOfMessages": "संदेशों की संख्या सीमित करें",
    "messageLimitDescription": "आउटपुट में संदेशों की संख्या की सीमा निर्धारित करें.",
    "quoteCharacterDescription": "CSV इनपुट फ़ील्ड को उद्धृत करने के लिए प्रयुक्त उद्धरण वर्ण दर्ज करें.",
    "resultTitle": "सीएसवी स्थिति",
    "shortDescription": "सीएसवी में जल्दी से पंक्तियां और स्तंभ खोजें जो मूल्य खो रहे हैं।",
    "title": "अधूरे सीएसवी रिकॉर्ड खोजें",
    "toolInfo": {
      "title": "{{title}} क्या है?"
    }
  },
  "findIncompleteRecords": {
    "checkEmptyValues": "खाली मूल्य जांचें",
    "description": "CSV फ़ाइल में अधूरे रिकॉर्ड खोजें।",
    "errorLimit": "त्रुटि सीमा",
    "inputTitle": "इनपुट CSV",
    "limitPlaceholder": "सीमा",
    "resultTitle": "अधूरे रिकॉर्ड",
    "searchOptions": "खोज विकल्प",
    "separatorPlaceholder": "विभाजक",
    "skipEmptyLines": "खाली पंक्तियां छोड़ें",
    "title": "अधूरे CSV रिकॉर्ड खोजें"
  },
  "insertColumns": {
    "columnNames": "स्तंभ नाम",
    "defaultValues": "डिफ़ॉल्ट मूल्य",
    "description": "CSV फ़ाइल में नए स्तंभ डालें।",
    "inputTitle": "इनपुट CSV",
    "insertPosition": "डालने की स्थिति",
    "insertionOptions": "डालने के विकल्प",
    "namesPlaceholder": "नाम (कॉमा से अलग)",
    "positionPlaceholder": "स्थिति",
    "resultTitle": "संशोधित CSV",
    "separatorPlaceholder": "विभाजक",
    "title": "CSV स्तंभ डालें",
    "valuesPlaceholder": "मूल्य (कॉमा से अलग)"
  },
  "insertCsvColumns": {
    "appendColumns": "कॉलम जोड़ें",
    "commentCharacterDescription": "टिप्पणी पंक्ति की शुरुआत दर्शाने वाला वर्ण दर्ज करें। इस चिह्न से शुरू होने वाली पंक्तियाँ छोड़ दी जाएँगी।",
    "csvOptions": "CSV विकल्प",
    "csvSeparator": "CSV विभाजक",
    "csvToInsert": "सम्मिलित करने के लिए CSV",
    "csvToInsertDescription": "CSV में डालने के लिए एक या एक से ज़्यादा कॉलम डालें। कॉलम को सीमांकित करने के लिए इस्तेमाल किया गया वर्ण CSV इनपुट फ़ाइल में मौजूद वर्ण के समान होना चाहिए। Ps: खाली पंक्तियों को अनदेखा कर दिया जाएगा।",
    "customFillDescription": "यदि इनपुट CSV फ़ाइल अपूर्ण है (मान गायब हैं), तो एक सुव्यवस्थित CSV बनाने के लिए रिकॉर्ड में रिक्त फ़ील्ड या कस्टम प्रतीक जोड़ें?",
    "customFillValueDescription": "रिक्त फ़ील्ड भरने के लिए इस कस्टम मान का उपयोग करें। (यह केवल ऊपर दिए गए \"कस्टम मान\" मोड के साथ काम करता है।)",
    "customPosition": "कस्टम स्थिति",
    "customPositionOptionsDescription": "CSV फ़ाइल में कॉलम सम्मिलित करने की विधि का चयन करें.",
    "description": "निर्दिष्ट स्थानों पर CSV डेटा में नए कॉलम जोड़ें.",
    "fillWithCustomValues": "सीमा शुल्क मूल्यों से भरें",
    "fillWithEmptyValues": "रिक्त मानों से भरें",
    "headerName": "हेडर का नाम",
    "headerNameDescription": "उस कॉलम का शीर्षलेख जिसके बाद आप कॉलम सम्मिलित करना चाहते हैं.",
    "inputTitle": "इनपुट CSV",
    "insertingPositionDescription": "निर्दिष्ट करें कि CSV फ़ाइल में कॉलम कहाँ सम्मिलित करना है.",
    "position": "पद",
    "positionOptions": "स्थिति विकल्प",
    "prependColumns": "कॉलम जोड़ें",
    "quoteCharDescription": "CSV इनपुट फ़ील्ड को उद्धृत करने के लिए प्रयुक्त उद्धरण वर्ण दर्ज करें.",
    "resultTitle": "आउटपुट CSV",
    "rowNumberDescription": "उस कॉलम की संख्या जिसके बाद आप कॉलम सम्मिलित करना चाहते हैं.",
    "separatorDescription": "CSV इनपुट फ़ाइल में कॉलम को सीमांकित करने के लिए प्रयुक्त वर्ण दर्ज करें.",
    "shortDescription": "CSV फ़ाइल में कहीं भी एक या अधिक नए कॉलम शीघ्रता से डालें.",
    "title": "CSV कॉलम डालें",
    "toolInfo": {
      "description": "यह टूल आपको CSV डेटा में निर्दिष्ट स्थानों पर नए कॉलम डालने की सुविधा देता है। आप हेडर नामों या कॉलम संख्याओं के आधार पर कस्टम स्थानों पर कॉलम जोड़, जोड़ या डाल सकते हैं।",
      "title": "CSV कॉलम डालें"
    }
  },
  "rowsToColumns": {
    "description": "CSV डेटा को पंक्तियों से स्तंभों में बदलें।",
    "includeHeaders": "शीर्षक शामिल करें",
    "inputTitle": "इनपुट CSV",
    "resultTitle": "परिवर्तित CSV",
    "separatorPlaceholder": "विभाजक",
    "title": "CSV पंक्तियां से स्तंभ",
    "transformationOptions": "परिवर्तन विकल्प",
    "transposeData": "डेटा ट्रांसपोज़ करें"
  },
  "swapColumns": {
    "description": "CSV फ़ाइल में स्तंभों की स्थिति बदलें।",
    "firstColumn": "पहला स्तंभ",
    "firstColumnPlaceholder": "स्तंभ संख्या",
    "inputTitle": "इनपुट CSV",
    "resultTitle": "संशोधित CSV",
    "secondColumn": "दूसरा स्तंभ",
    "secondColumnPlaceholder": "स्तंभ संख्या",
    "separatorPlaceholder": "विभाजक",
    "swapOptions": "बदलने के विकल्प",
    "title": "CSV स्तंभ बदलें"
  },
  "swapCsvColumns": {
    "description": "बस नीचे दिए गए फ़ॉर्म में अपनी CSV फ़ाइल अपलोड करें, स्वैप करने के लिए कॉलम निर्दिष्ट करें, और टूल स्वचालित रूप से आउटपुट फ़ाइल में निर्दिष्ट कॉलम की स्थिति बदल देगा। टूल विकल्पों में, आप उन कॉलम की स्थिति या नाम निर्दिष्ट कर सकते हैं जिन्हें आप स्वैप करना चाहते हैं, साथ ही अधूरे डेटा को ठीक कर सकते हैं और वैकल्पिक रूप से खाली रिकॉर्ड और टिप्पणी किए गए रिकॉर्ड हटा सकते हैं।",
    "longDescription": "यह टूल CSV डेटा के कॉलम की स्थिति बदलकर उसे पुनर्व्यवस्थित करता है। कॉलम बदलने से अक्सर इस्तेमाल होने वाले डेटा को एक साथ या आगे रखकर CSV फ़ाइल की पठनीयता बढ़ाई जा सकती है, जिससे डेटा की तुलना और संपादन आसान हो जाता है। उदाहरण के लिए, आप पहले कॉलम को आखिरी कॉलम से या दूसरे कॉलम को तीसरे कॉलम से बदल सकते हैं। कॉलम की स्थिति के आधार पर उन्हें बदलने के लिए, चुनें",
    "shortDescription": "CSV कॉलम पुनःक्रमित करें.",
    "title": "CSV कॉलम स्वैप करें"
  },
  "transposeCsv": {
    "description": "CSV डेटा को ट्रांसपोज़ करें (पंक्तियों को स्तंभों में बदलें)।",
    "includeHeaders": "शीर्षक शामिल करें",
    "inputTitle": "इनपुट CSV",
    "longDescription": "यह टूल कॉमा सेपरेटेड वैल्यूज़ (CSV) को ट्रांसपोज़ करता है। यह CSV को डेटा के एक मैट्रिक्स की तरह मानता है और सभी तत्वों को मुख्य विकर्ण पर पलट देता है। आउटपुट में इनपुट के समान ही CSV डेटा होता है, लेकिन अब सभी पंक्तियाँ कॉलम में बदल गई हैं, और सभी कॉलम पंक्तियाँ में बदल गए हैं। ट्रांसपोज़िशन के बाद, CSV फ़ाइल के आयाम विपरीत होंगे। उदाहरण के लिए, यदि इनपुट फ़ाइल में 4 कॉलम और 3 पंक्तियाँ हैं, तो आउटपुट फ़ाइल में 3 कॉलम और 4 पंक्तियाँ होंगी। रूपांतरण के दौरान, प्रोग्राम अनावश्यक पंक्तियों से डेटा भी साफ़ करता है और अधूरे डेटा को सही करता है। विशेष रूप से, यह टूल किसी विशिष्ट वर्ण से शुरू होने वाले सभी रिक्त रिकॉर्ड और टिप्पणियों को स्वचालित रूप से हटा देता है, जिसे आप विकल्प में सेट कर सकते हैं। इसके अतिरिक्त, ऐसे मामलों में जहाँ CSV डेटा दूषित या खो गया है, उपयोगिता फ़ाइल को रिक्त फ़ील्ड या कस्टम फ़ील्ड से भर देती है जिन्हें विकल्पों में निर्दिष्ट किया जा सकता है। Csv-abulous!",
    "resultTitle": "ट्रांसपोज़ किया गया CSV",
    "separatorPlaceholder": "विभाजक",
    "shortDescription": "CSV फ़ाइल को शीघ्रता से ट्रांसपोज़ करें.",
    "title": "CSV ट्रांसपोज़ करें",
    "transposeOptions": "ट्रांसपोज़ विकल्प"
  }
}
