{
  "base64": {
    "decode": "बेस64 डिकोड",
    "description": "बेस64 एनकोडिंग का उपयोग करके टेक्स्ट को एनकोड या डिकोड करें।",
    "encode": "बेस64 एनकोड",
    "inputTitle": "इनपुट डेटा",
    "optionsTitle": "बेस64 विकल्प",
    "resultTitle": "परिणाम",
    "shortDescription": "बेस64 का उपयोग करके डेटा को एनकोड या डिकोड करें।",
    "title": "बेस64 एनकोडर/डिकोडर",
    "toolInfo": {
      "description": "बेस64 एक एनकोडिंग योजना है जो डेटा को रेडिक्स-64 प्रतिनिधित्व में अनुवाद करके ASCII स्ट्रिंग प्रारूप में प्रस्तुत करती है। हालांकि इसका उपयोग स्ट्रिंग्स को एनकोड करने के लिए किया जा सकता है, यह आमतौर पर बाइनरी डेटा को एनकोड करने के लिए उपयोग किया जाता है जो टेक्स्ट डेटा से निपटने के लिए डिज़ाइन किए गए मीडिया पर प्रसारण के लिए होता है।",
      "title": "बेस64 क्या है?"
    }
  },
  "censor": {
    "description": "पाठ में शब्दों को सेंसर करने की उपयोगिता। बाईं ओर दिए गए इनपुट फ़ॉर्म में अपना पाठ लोड करें, विकल्पों में सभी गलत शब्द निर्दिष्ट करें, और आपको आउटपुट क्षेत्र में तुरंत सेंसर किया गया पाठ मिल जाएगा।\", longDescription: 'इस ऑनलाइन टूल से, आप किसी भी पाठ में कुछ शब्दों को सेंसर कर सकते हैं। आप अवांछित शब्दों (जैसे अपशब्द या गुप्त शब्द) की एक सूची निर्दिष्ट कर सकते हैं और प्रोग्राम उन्हें वैकल्पिक शब्दों से बदलकर एक सुरक्षित पाठ तैयार कर देगा। विकल्पों में एक बहु-पंक्ति पाठ फ़ील्ड में प्रति पंक्ति एक शब्द दर्ज करके शब्दों को निर्दिष्ट किया जा सकता है।', keywords: ['text', 'censor', 'words', 'characters'], component: lazy(() => import('./index')), i18n: { name: 'string:censor.title', description: 'string:censor.description'",
    "shortDescription": "बुरे शब्दों को तुरंत हटा दें या उन्हें वैकल्पिक शब्दों से बदल दें।",
    "title": "पाठ सेंसर"
  },
  "createPalindrome": {
    "description": "किसी भी टेक्स्ट से पैलिंड्रोम बनाने के लिए दुनिया का सबसे सरल ब्राउज़र-आधारित उपयोगिता। टेक्स्ट इनपुट करें और इसे तुरंत एक पैलिंड्रोम में बदल दें जो आगे और पीछे एक जैसा पढ़ता है। शब्द खेलों, सममित टेक्स्ट पैटर्न बनाने, या भाषाई जिज्ञासाओं की खोज के लिए बिल्कुल सही।",
    "shortDescription": "ऐसा टेक्स्ट बनाएं जो आगे और पीछे एक जैसा पढ़ता है",
    "title": "पैलिंड्रोम बनाएं"
  },
  "extractSubstring": {
    "description": "टेक्स्ट से सबस्ट्रिंग निकालने के लिए दुनिया की सबसे सरल ब्राउज़र-आधारित उपयोगिता। अपना टेक्स्ट इनपुट करें और वांछित भाग निकालने के लिए आरंभ और अंत स्थितियाँ निर्दिष्ट करें। डेटा प्रोसेसिंग, टेक्स्ट विश्लेषण, या बड़े टेक्स्ट ब्लॉक से विशिष्ट सामग्री निकालने के लिए बिल्कुल सही।",
    "shortDescription": "निर्दिष्ट स्थानों के बीच पाठ का एक भाग निकालें",
    "title": "सबस्ट्रिंग निकालें"
  },
  "hiddenCharacterDetector": {
    "analysisOptions": "विश्लेषण विकल्प",
    "category": "वर्ग",
    "description": "छिपे हुए यूनिकोड वर्णों का पता लगाएं, विशेष रूप से RTL ओवरराइड वर्णों का, जिनका उपयोग हमलों में किया जा सकता है।",
    "foundChars": "मिला {{count}} छिपे हुए अक्षर:",
    "inputPlaceholder": "छिपे हुए वर्णों की जांच करने के लिए पाठ दर्ज करें...",
    "inputTitle": "विश्लेषण करने के लिए पाठ",
    "invisibleChar": "अदृश्य चरित्र",
    "invisibleFound": "अदृश्य अक्षर मिले",
    "longDescription": "यह टूल आपको टेक्स्ट में छिपे यूनिकोड वर्णों, खासकर दाएँ से बाएँ (RTL) ओवरराइड वर्णों का पता लगाने में मदद करता है, जिनका इस्तेमाल हमलों में किया जा सकता है। यह अदृश्य वर्णों, शून्य-चौड़ाई वाले वर्णों और अन्य संभावित रूप से दुर्भावनापूर्ण यूनिकोड अनुक्रमों की पहचान कर सकता है जो दिखने में निर्दोष टेक्स्ट में छिपे हो सकते हैं।",
    "noHiddenChars": "पाठ में कोई छिपा हुआ अक्षर नहीं पाया गया।",
    "optionsDescription": "कॉन्फ़िगर करें कि किस प्रकार के छिपे हुए वर्णों का पता लगाना है और परिणाम कैसे प्रदर्शित करने हैं।",
    "position": "पद",
    "rtlAlert": "⚠️ RTL ओवरराइड वर्णों का पता चला! इस पाठ में दुर्भावनापूर्ण छिपे हुए वर्ण हो सकते हैं।",
    "rtlFound": "RTL ओवरराइड पाया गया",
    "rtlOverride": "RTL ओवरराइड कैरेक्टर",
    "rtlWarning": "चेतावनी: RTL ओवरराइड वर्णों का पता चला है! इसका इस्तेमाल हमलों में किया जा सकता है।",
    "shortDescription": "पाठ में छिपे यूनिकोड वर्णों को ढूंढें",
    "summary": "विश्लेषण सारांश",
    "title": "छिपे हुए चरित्र डिटेक्टर",
    "totalChars": "कुल छिपे हुए अक्षर: {{count}}",
    "unicode": "यूनिकोड",
    "zeroWidthChar": "शून्य चौड़ाई वर्ण",
    "zeroWidthFound": "शून्य-चौड़ाई वाले वर्ण मिले"
  },
  "join": {
    "blankLinesAndTrailingSpaces": "खाली पंक्तियां और अनुगामी स्थान",
    "deleteBlankDescription": "उन पंक्तियों को हटाएं जिनमें टेक्स्ट प्रतीक नहीं हैं।",
    "deleteBlankTitle": "खाली पंक्तियां हटाएं",
    "deleteTrailingDescription": "पंक्तियों के अंत से स्पेस और टैब हटाएं।",
    "deleteTrailingTitle": "अनुगामी स्थान हटाएं",
    "description": "कस्टमाइज़ करने योग्य विभाजकों के साथ टेक्स्ट टुकड़ों को एक साथ जोड़ें।",
    "inputTitle": "टेक्स्ट टुकड़े",
    "joinCharacterDescription": "प्रतीक जो टेक्स्ट के टूटे हुए टुकड़ों को जोड़ता है। (डिफ़ॉल्ट रूप से स्पेस।)",
    "joinCharacterPlaceholder": "जोड़ने का वर्ण",
    "resultTitle": "जुड़ा हुआ टेक्स्ट",
    "shortDescription": "निर्दिष्ट विभाजक के साथ पाठ तत्वों को जोड़ें",
    "textMergedOptions": "टेक्स्ट मर्ज विकल्प",
    "title": "टेक्स्ट जोड़ें",
    "toolInfo": {
      "description": "इस टूल के साथ आप टेक्स्ट के भागों को एक साथ जोड़ सकते हैं। यह नई पंक्तियों से अलग किए गए टेक्स्ट मूल्यों की सूची लेता है और उन्हें एक साथ मर्ज करता है। आप उस वर्ण को सेट कर सकते हैं जो संयुक्त टेक्स्ट के भागों के बीच रखा जाएगा। साथ ही, आप सभी खाली पंक्तियों को अनदेखा कर सकते हैं और सभी पंक्तियों के अंत से स्पेस और टैब हटा सकते हैं। टेक्स्टाबुलस!",
      "title": "टेक्स्ट जोइनर क्या है?"
    }
  },
  "palindrome": {
    "description": "यह जांचने के लिए दुनिया का सबसे सरल ब्राउज़र-आधारित उपयोगिता कि टेक्स्ट पैलिंड्रोम है या नहीं। तुरंत सत्यापित करें कि क्या आपका टेक्स्ट आगे और पीछे एक जैसा पढ़ता है। शब्द पहेलियों, भाषाई विश्लेषण, या सममित टेक्स्ट पैटर्न को मान्य करने के लिए बिल्कुल सही। विभिन्न विभाजकों और बहु-शब्द पैलिंड्रोम पहचान का समर्थन करता है।",
    "shortDescription": "जांचें कि क्या टेक्स्ट आगे और पीछे एक जैसा पढ़ता है",
    "title": "पैलिंड्रोम"
  },
  "passwordGenerator": {
    "avoidAmbiguous": "अस्पष्ट वर्णों (i, I, l, 0, O) से बचें",
    "description": "अनुकूलन योग्य लंबाई और वर्ण प्रकारों के साथ सुरक्षित, यादृच्छिक पासवर्ड बनाएँ। लोअरकेस, अपरकेस, संख्याएँ और विशेष वर्णों में से चुनें। बेहतर पठनीयता के लिए अस्पष्ट वर्णों से बचने का विकल्प।",
    "includeLowercase": "छोटे अक्षर (a-z) शामिल करें",
    "includeNumbers": "संख्याएँ शामिल करें (0-9)",
    "includeSymbols": "विशेष वर्ण शामिल करें",
    "includeUppercase": "बड़े अक्षर (A-Z) शामिल करें",
    "lengthDesc": "पासवर्ड की लंबाई",
    "lengthPlaceholder": "उदाहरणार्थ 12",
    "optionsTitle": "पासवर्ड विकल्प",
    "resultTitle": "जनरेट किया गया पासवर्ड",
    "shortDescription": "कस्टम विकल्पों के साथ सुरक्षित यादृच्छिक पासवर्ड उत्पन्न करें",
    "title": "पासवर्ड जनरेटर",
    "toolInfo": {
      "description": "यह टूल आपके चुने हुए मानदंडों के आधार पर सुरक्षित, यादृच्छिक पासवर्ड बनाता है। आप लंबाई को अनुकूलित कर सकते हैं, विभिन्न प्रकार के वर्णों को शामिल या हटा सकते हैं, और बेहतर पठनीयता के लिए अस्पष्ट वर्णों से बच सकते हैं। खातों, एप्लिकेशन या किसी भी सुरक्षा आवश्यकताओं के लिए मज़बूत पासवर्ड बनाने के लिए यह एकदम सही है।",
      "title": "पासवर्ड जनरेटर के बारे में"
    }
  },
  "quote": {
    "allowDoubleQuotation": "दोहरे उद्धरण की अनुमति दें",
    "description": "कस्टमाइज़ करने योग्य विकल्पों के साथ टेक्स्ट के चारों ओर उद्धरण जोड़ें।",
    "inputTitle": "इनपुट टेक्स्ट",
    "leftQuoteDescription": "बाएं उद्धरण वर्ण",
    "processAsMultiLine": "बहु-पंक्ति टेक्स्ट के रूप में प्रक्रिया करें",
    "quoteEmptyLines": "खाली पंक्तियों को कोट करें",
    "quoteOptions": "उद्धरण विकल्प",
    "resultTitle": "कोटेड टेक्स्ट",
    "rightQuoteDescription": "दाएं उद्धरण वर्ण",
    "shortDescription": "विभिन्न शैलियों के साथ पाठ के चारों ओर उद्धरण जोड़ें",
    "title": "टेक्स्ट कोटर",
    "toolInfo": {
      "description": "यह टूल आपको टेक्स्ट के चारों ओर उद्धरण जोड़ने की अनुमति देता है। आप विभिन्न उद्धरण वर्ण चुन सकते हैं, बहु-पंक्ति टेक्स्ट को संभाल सकते हैं, और नियंत्रित कर सकते हैं कि खाली पंक्तियों को कैसे संसाधित किया जाता है। यह प्रोग्रामिंग के लिए टेक्स्ट तैयार करने, डेटा को फॉर्मेट करने, या स्टाइलिश टेक्स्ट बनाने के लिए उपयोगी है।",
      "title": "टेक्स्ट कोटर"
    }
  },
  "randomizeCase": {
    "description": "टेक्स्ट केस को रैंडमाइज़ करने के लिए दुनिया की सबसे सरल ब्राउज़र-आधारित उपयोगिता। अपना टेक्स्ट इनपुट करें और उसे तुरंत रैंडम अपर और लोअर केस अक्षरों से बदल दें। अनोखे टेक्स्ट इफ़ेक्ट बनाने, केस सेंसिटिविटी टेस्ट करने, या अलग-अलग टेक्स्ट पैटर्न बनाने के लिए बिल्कुल सही।",
    "shortDescription": "पाठ में अक्षरों के केस को यादृच्छिक करें",
    "title": "मामले को यादृच्छिक करें"
  },
  "removeDuplicateLines": {
    "description": "बाईं ओर दिए गए इनपुट फ़ॉर्म में अपना टेक्स्ट लोड करें और आपको तुरंत ऐसा टेक्स्ट मिलेगा जिसमें आउटपुट क्षेत्र में कोई डुप्लिकेट लाइन नहीं होगी। शक्तिशाली, मुफ़्त और तेज़। टेक्स्ट लाइन लोड करें - अनोखी टेक्स्ट लाइन प्राप्त करें",
    "shortDescription": "पाठ से सभी दोहराई गई पंक्तियों को तुरंत हटाएँ",
    "title": "डुप्लिकेट पंक्तियाँ हटाएँ"
  },
  "repeat": {
    "delimiterDescription": "आउटपुट प्रतियों के लिए विभाजक।",
    "delimiterPlaceholder": "विभाजक",
    "description": "कस्टमाइज़ करने योग्य विभाजकों के साथ टेक्स्ट को कई बार दोहराएं।",
    "inputTitle": "इनपुट टेक्स्ट",
    "numberPlaceholder": "संख्या",
    "repeatAmountDescription": "दोहराव की संख्या।",
    "repetitionsDelimiter": "दोहराव विभाजक",
    "resultTitle": "दोहराया गया टेक्स्ट",
    "shortDescription": "टेक्स्ट को कई बार दोहराएं",
    "textRepetitions": "टेक्स्ट दोहराव",
    "title": "टेक्स्ट दोहराएं",
    "toolInfo": {
      "description": "यह टूल आपको वैकल्पिक विभाजक के साथ दिए गए टेक्स्ट को कई बार दोहराने की अनुमति देता है।",
      "title": "टेक्स्ट दोहराएं"
    }
  },
  "reverse": {
    "description": "टेक्स्ट में वर्णों के क्रम को उलटा करें।",
    "inputTitle": "इनपुट टेक्स्ट",
    "processMultiLine": "बहु-पंक्ति टेक्स्ट के रूप में प्रक्रिया करें (प्रत्येक पंक्ति को अलग से उलटा करें)",
    "processMultiLineDescription": "प्रत्येक पंक्ति स्वतंत्र रूप से उलटी जाएगी",
    "resultTitle": "उलटा टेक्स्ट",
    "reversalOptions": "उलट विकल्प",
    "shortDescription": "किसी भी टेक्स्ट को वर्ण दर वर्ण उलटा करें",
    "skipEmptyLines": "खाली पंक्तियों को छोड़ें",
    "skipEmptyLinesDescription": "आउटपुट से खाली लाइनें हटा दी जाएंगी",
    "title": "टेक्स्ट उलटा करें",
    "trimWhitespace": "पंक्तियों से सफेद स्थान ट्रिम करें",
    "trimWhitespaceDescription": "प्रत्येक पंक्ति से आरंभिक और अंतिम रिक्त स्थान हटाएँ"
  },
  "rot13": {
    "description": "ROT13 सिफर का उपयोग करके टेक्स्ट को एनकोड या डिकोड करें।",
    "inputTitle": "इनपुट टेक्स्ट",
    "resultTitle": "ROT13 परिणाम",
    "shortDescription": "ROT13 सिफर का उपयोग करके टेक्स्ट को एनकोड या डिकोड करें।",
    "title": "ROT13 एनकोडर/डिकोडर",
    "toolInfo": {
      "description": "ROT13 (13 स्थानों से घुमाएं) एक सरल अक्षर प्रतिस्थापन सिफर है जो एक अक्षर को वर्णमाला में उसके बाद के 13वें अक्षर से बदल देता है। ROT13 सीज़र सिफर का एक विशेष मामला है जो प्राचीन रोम में विकसित किया गया था। क्योंकि अंग्रेजी वर्णमाला में 26 अक्षर हैं, ROT13 अपना स्वयं का व्युत्क्रम है; अर्थात, ROT13 को पूर्ववत करने के लिए, एक ही एल्गोरिथम लागू किया जाता है, इसलिए एनकोडिंग और डिकोडिंग दोनों के लिए एक ही क्रिया का उपयोग किया जा सकता है।",
      "title": "ROT13 क्या है?"
    }
  },
  "rotate": {
    "description": "निर्दिष्ट स्थानों द्वारा टेक्स्ट में वर्णों को घुमाएं।",
    "inputTitle": "इनपुट टेक्स्ट",
    "processAsMultiLine": "बहु-पंक्ति टेक्स्ट के रूप में प्रक्रिया करें (प्रत्येक पंक्ति को अलग से घुमाएं)",
    "resultTitle": "घुमाया गया टेक्स्ट",
    "rotateLeft": "बाईं ओर घुमाएं",
    "rotateRight": "दाईं ओर घुमाएं",
    "rotationOptions": "घुमाने के विकल्प",
    "shortDescription": "पाठ में वर्णों को स्थान के अनुसार स्थानांतरित करें।",
    "stepDescription": "घुमाने के लिए स्थानों की संख्या",
    "title": "टेक्स्ट घुमाएं",
    "toolInfo": {
      "description": "यह टूल आपको निर्दिष्ट संख्या में स्थानों द्वारा स्ट्रिंग में वर्णों को घुमाने की अनुमति देता है। आप बाएं या दाएं घुमा सकते हैं, और प्रत्येक पंक्ति को अलग से घुमाकर बहु-पंक्ति टेक्स्ट को संसाधित कर सकते हैं। स्ट्रिंग रोटेशन सरल टेक्स्ट परिवर्तनों, पैटर्न बनाने, या बुनियादी एन्क्रिप्शन तकनीकों को लागू करने के लिए उपयोगी है।",
      "title": "स्ट्रिंग रोटेशन"
    }
  },
  "split": {
    "charAfterChunkDescription": "प्रत्येक चंक के बाद वर्ण",
    "charBeforeChunkDescription": "प्रत्येक चंक से पहले वर्ण",
    "chunksDescription": "आउटपुट में समान लंबाई के चंक की संख्या।",
    "chunksTitle": "चंक की संख्या का उपयोग करें",
    "description": "विभिन्न मानदंडों के आधार पर टेक्स्ट को भागों में विभाजित करें।",
    "lengthDescription": "प्रत्येक आउटपुट चंक में रखे जाने वाले वर्णों की संख्या।",
    "lengthTitle": "विभाजन के लिए लंबाई का उपयोग करें",
    "outputSeparatorDescription": "वर्ण जो विभाजित चंक के बीच रखा जाएगा। (यह डिफ़ॉल्ट रूप से नई पंक्ति \"\\n\" है।)",
    "outputSeparatorOptions": "आउटपुट विभाजक विकल्प",
    "regexDescription": "नियमित अभिव्यक्ति जो टेक्स्ट को भागों में तोड़ने के लिए उपयोग की जाएगी। (डिफ़ॉल्ट रूप से कई स्पेस।)",
    "regexTitle": "विभाजन के लिए रेगेक्स का उपयोग करें",
    "resultTitle": "टेक्स्ट टुकड़े",
    "shortDescription": "विभाजक का उपयोग करके पाठ को कई भागों में विभाजित करें",
    "splitSeparatorOptions": "विभाजक विकल्प",
    "symbolDescription": "वर्ण जो टेक्स्ट को भागों में तोड़ने के लिए उपयोग किया जाएगा। (डिफ़ॉल्ट रूप से स्पेस।)",
    "symbolTitle": "विभाजन के लिए प्रतीक का उपयोग करें",
    "title": "टेक्स्ट विभाजित करें"
  },
  "statistic": {
    "characterFrequencyAnalysis": "वर्ण आवृत्ति विश्लेषण",
    "characterFrequencyAnalysisDescription": "गणना करें कि प्रत्येक वर्ण टेक्स्ट में कितनी बार दिखाई देता है",
    "delimitersOptions": "विभाजक विकल्प",
    "description": "टेक्स्ट का विश्लेषण करें और व्यापक आंकड़े उत्पन्न करें।",
    "includeEmptyLines": "खाली पंक्तियां शामिल करें",
    "includeEmptyLinesDescription": "पंक्तियों की गणना करते समय खाली पंक्तियां शामिल करें",
    "inputTitle": "इनपुट टेक्स्ट",
    "resultTitle": "टेक्स्ट आंकड़े",
    "sentenceDelimitersDescription": "अपनी भाषा में वाक्यों को विभाजित करने के लिए उपयोग किए जाने वाले कस्टम वर्ण दर्ज करें (कॉमा से अलग) या डिफ़ॉल्ट के लिए इसे खाली छोड़ दें।",
    "sentenceDelimitersPlaceholder": "जैसे ., !, ?, ...",
    "shortDescription": "अपने पाठ के बारे में आँकड़े प्राप्त करें",
    "statisticsOptions": "आंकड़े विकल्प",
    "title": "टेक्स्ट आंकड़े",
    "toolInfo": {
      "description": "यह टूल आपको टेक्स्ट का विश्लेषण करने और वर्ण गणना, शब्द गणना, पंक्ति गणना, और वर्णों और शब्दों के आवृत्ति विश्लेषण सहित व्यापक आंकड़े उत्पन्न करने की अनुमति देता है।",
      "title": "{{title}} क्या है?"
    },
    "wordDelimitersDescription": "शब्दों की गणना के लिए कस्टम रेगेक्स दर्ज करें या डिफ़ॉल्ट के लिए इसे खाली छोड़ दें।",
    "wordDelimitersPlaceholder": "जैसे \\s.,;:!?\"«»()…",
    "wordFrequencyAnalysis": "शब्द आवृत्ति विश्लेषण",
    "wordFrequencyAnalysisDescription": "गणना करें कि प्रत्येक शब्द टेक्स्ट में कितनी बार दिखाई देता है"
  },
  "textReplacer": {
    "description": "टेक्स्ट पैटर्न को नई सामग्री से बदलें।",
    "findPatternInText": "टेक्स्ट में यह पैटर्न खोजें",
    "findPatternUsingRegexp": "रेगेक्स का उपयोग करके पैटर्न खोजें",
    "inputTitle": "बदलने के लिए टेक्स्ट",
    "newTextPlaceholder": "नया टेक्स्ट",
    "regexpDescription": "उस नियमित अभिव्यक्ति को दर्ज करें जिसे आप बदलना चाहते हैं।",
    "replacePatternDescription": "प्रतिस्थापन के लिए उपयोग करने के लिए पैटर्न दर्ज करें।",
    "replaceText": "टेक्स्ट बदलें",
    "resultTitle": "प्रतिस्थापन के साथ टेक्स्ट",
    "searchPatternDescription": "उस टेक्स्ट पैटर्न को दर्ज करें जिसे आप बदलना चाहते हैं।",
    "searchText": "खोज टेक्स्ट",
    "shortDescription": "अपनी सामग्री में टेक्स्ट को तुरंत बदलें",
    "title": "टेक्स्ट रिप्लेसर",
    "toolInfo": {
      "description": "इस सरल, ब्राउज़र-आधारित टूल के साथ अपनी सामग्री में विशिष्ट टेक्स्ट को आसानी से बदलें। बस अपना टेक्स्ट इनपुट करें, उस टेक्स्ट को सेट करें जिसे आप बदलना चाहते हैं और प्रतिस्थापन मूल्य, और तुरंत अपडेटेड संस्करण प्राप्त करें।",
      "title": "टेक्स्ट रिप्लेसर"
    }
  },
  "toMorse": {
    "dashSymbolDescription": "प्रतीक जो मोर्स कोड में डैश के अनुरूप होगा।",
    "description": "टेक्स्ट को मोर्स कोड में बदलें।",
    "dotSymbolDescription": "प्रतीक जो मोर्स कोड में डॉट के अनुरूप होगा।",
    "longSignal": "लंबा संकेत",
    "resultTitle": "मोर्स कोड",
    "shortDescription": "टेक्स्ट को जल्दी से मोर्स में एनकोड करें",
    "shortSignal": "छोटा संकेत",
    "title": "मोर्स में"
  },
  "truncate": {
    "addTruncationIndicator": "काटने का संकेतक जोड़ें",
    "charactersPlaceholder": "वर्ण",
    "description": "टेक्स्ट को निर्दिष्ट लंबाई तक छोटा करें।",
    "indicatorDescription": "टेक्स्ट के अंत (या शुरुआत) में जोड़ने के लिए वर्ण। नोट: वे लंबाई की ओर गिने जाते हैं।",
    "inputTitle": "इनपुट टेक्स्ट",
    "leftSideDescription": "टेक्स्ट की शुरुआत से वर्ण हटाएं।",
    "leftSideTruncation": "बाईं तरफ काटना",
    "lengthAndLines": "लंबाई और पंक्तियां",
    "lineByLineDescription": "प्रत्येक पंक्ति को अलग से काटें।",
    "lineByLineTruncating": "पंक्ति दर पंक्ति काटना",
    "maxLengthDescription": "टेक्स्ट में छोड़ने के लिए वर्णों की संख्या।",
    "numberPlaceholder": "संख्या",
    "resultTitle": "काटा गया टेक्स्ट",
    "rightSideDescription": "टेक्स्ट के अंत से वर्ण हटाएं।",
    "rightSideTruncation": "दाईं तरफ काटना",
    "shortDescription": "पाठ को निर्दिष्ट लंबाई तक छोटा करें",
    "suffixAndAffix": "प्रत्यय और उपसर्ग",
    "title": "टेक्स्ट काटें",
    "toolInfo": {
      "description": "बाईं ओर इनपुट फॉर्म में अपना टेक्स्ट लोड करें और आपको दाईं ओर स्वचालित रूप से काटा गया टेक्स्ट मिलेगा।",
      "title": "टेक्स्ट काटें"
    },
    "truncationSide": "काटने की तरफ"
  },
  "uppercase": {
    "description": "टेक्स्ट को बड़े अक्षरों में बदलें।",
    "inputTitle": "इनपुट टेक्स्ट",
    "resultTitle": "बड़े अक्षरों में टेक्स्ट",
    "shortDescription": "पाठ को बड़े अक्षरों में बदलें",
    "title": "बड़े अक्षरों में बदलें"
  },
  "urlDecode": {
    "inputTitle": "इनपुट स्ट्रिंग(URL-एस्केप)",
    "resultTitle": "आउटपुट स्ट्रिंग",
    "toolInfo": {
      "description": "अपनी स्ट्रिंग लोड करें और यह स्वचालित रूप से URL-unescaped हो जाएगी।",
      "longDescription": "यह टूल पहले से URL-एन्कोडेड स्ट्रिंग को URL-डिकोड करता है। URL-डिकोडिंग, URL-एन्कोडिंग का विपरीत ऑपरेशन है। सभी प्रतिशत-एन्कोडेड वर्ण उन वर्णों में डिकोड हो जाते हैं जिन्हें आप समझ सकते हैं। कुछ सबसे प्रसिद्ध प्रतिशत-एन्कोडेड मान हैं: स्पेस के लिए %20, कोलन के लिए %3a, स्लैश के लिए %2f, और प्रश्नवाचक चिह्न के लिए %3f। प्रतिशत चिह्न के बाद के दो अंक हेक्स में वर्ण के चार कोड मान हैं।",
      "shortDescription": "किसी स्ट्रिंग को शीघ्रता से URL-अनस्केप करें।",
      "title": "स्ट्रिंग URL डिकोडर"
    }
  },
  "urlEncode": {
    "encodingOption": {
      "nonSpecialCharDescription": "यदि चयनित किया जाता है, तो इनपुट स्ट्रिंग के सभी वर्ण URL-एन्कोडिंग में परिवर्तित हो जाएंगे (केवल विशेष नहीं)।",
      "nonSpecialCharPlaceholder": "गैर-विशेष वर्णों को एनकोड करें",
      "title": "एन्कोडिंग विकल्प"
    },
    "inputTitle": "इनपुट स्ट्रिंग",
    "resultTitle": "URL-एस्केप स्ट्रिंग",
    "toolInfo": {
      "description": "अपनी स्ट्रिंग लोड करें और यह स्वचालित रूप से URL-एस्केप हो जाएगी।",
      "longDescription": "यह टूल एक स्ट्रिंग को URL-एनकोड करता है। विशेष URL वर्ण प्रतिशत-चिह्न एन्कोडिंग में परिवर्तित हो जाते हैं। इस एन्कोडिंग को प्रतिशत-एनकोडिंग इसलिए कहा जाता है क्योंकि प्रत्येक वर्ण का संख्यात्मक मान प्रतिशत चिह्न में परिवर्तित हो जाता है जिसके बाद दो अंकों का हेक्साडेसिमल मान आता है। हेक्स मान वर्ण के कोडपॉइंट मान के आधार पर निर्धारित होते हैं। उदाहरण के लिए, %20 में स्पेस, %3a में कोलन और %2f में स्लैश एस्केप हो जाता है। जो वर्ण विशेष नहीं हैं वे अपरिवर्तित रहते हैं। यदि आपको गैर-विशेष वर्णों को भी प्रतिशत-एनकोडिंग में बदलने की आवश्यकता है, तो हमने एक अतिरिक्त विकल्प भी जोड़ा है जिससे आप ऐसा कर सकते हैं। इस व्यवहार को सक्षम करने के लिए encode-non-special-chars विकल्प चुनें।",
      "shortDescription": "किसी स्ट्रिंग को शीघ्रता से URL-एस्केप करें.",
      "title": "स्ट्रिंग URL एनकोडर"
    }
  }
}
